finished architectural pass, update docs and configs
